import UIKit

// ENUMERATIONS: перечисления

/*
 1. напиши: что такое enum, их сущность и назначение.
Где и как их можно использовать? */


/*
 2. напиши 10 enum разных типов. NB: создай СВОИ enums. Соблюдай правила написания. Пропусти их через switch и распечатай */

/*
 3. создай свое резюме, используя enum: имя, проф., возраст, навыки, образование, хобби и пр.
 Пропусти резюме через if-else/switch - ??? - пойми читаемость/красоту кода.
 Оцени первый/второй вариант написания */

/*
 4. используй enum и задай цвета для MacBook, IPhone, IPad, AppleWatch.
 Девайсы располагаем в теле функции. Итог программы: "Айфон - розовый" */
