import UIKit

var greeting = "Hello, playground"

/* Задача 3: Определение места обитания
Напишите программу, которая запрашивает у юзера имя персонажа из “Хоббита” и выводит его место обитания:
    •    Если персонаж “Хоббит”, вывести “Шир.”
    •    Если персонаж “Эльф”, вывести “Лесной Царство или Ривенделл.”
    •    Если персонаж “Гном”, вывести “Эребор или горы.”
    •    Если персонаж “Человек”, вывести “Озерный Город или Дейл.”
    •    Если персонаж “Тролль”, вывести “Леса и Троллистое плато.”
    •    Если персонаж не из списка, вывести “Неизвестное место обитания.” */

let person = "Hobbit"

switch person {
case "Elf":
    print("Rivendell")
case "Dworth":
    print("Blu Mountains")
case "Troll":
    print("Troll's plato")
case "Hobbit":
    print("Shir")
default:
    print("Unknown place")
}
