import UIKit

// CLOSURES. Замыкания

// 1. Напиши: что такое замыкания и для чего они нужны?

/* Closures - это 'замыкания' - небольшие блоки кода, функции,  которые можно передавать и
 использовать в разных частях программы. Похожи на функции, но НЕ имеют имени. Замыкания могут захватывать значения/переменные из ОКРУЖАЮЩЕГО кода/внешней области видимости и использовать их ВНУТРИ себя.
 Замыкания НУЖНЫ для:
 1. передачи функциональности - передавать как аргумент функциям / возвращаемые значения или использовать в обработке событий
 2. создания гибких конструкций - более выразительный и гибкий код
 3. выполнения задач: асинхронные операции / настройка функций для разных задач */
// простой closure БЕЗ параметров:
let closureHello = { print("Hello, World!") }
closureHello()
// closure С параметрами:
let sumClosure: (Int, Int) -> Int = { x, y in return x + y }
let result = sumClosure(4, 6)
print(result)
// closure С захватом переменных из внешнего окружения
var externalVar = 12
let captureClosure = { print(externalVar) }
captureClosure()

// 2. Напиши 10 замыканий на примере сортировок массивов.

/* 3. Напиши функцию, которая принимает массив, проверяет: пустой/нет.
И если пуст - добавь значение и выведи на консоль */

/* 4. Напиши функцию - сайт с именем, фамилией, ником, e-mail, паролем
и выведи в консоль */

/* 5. Напиши функции, которые принимают в кач-ве аргументов массивы/словари
 и проверяют: пустые/нет. Если пустые - добавь значение, выведи на консоль */
