import UIKit

var greeting = "Hello, playground"
// DICTIONARY: словари
/*
СЛОВАРЬ - это НЕупорядоченная коллекция элементов, для доступа к ним - ключи. Каждый элемент = пара: 'ключ + значение'. НО ключ  - НЕ авто.сгенерированный индекс(как в МАССИВАХ) - ключ - это УНИКАЛЬНОЕ значение ПРОИЗВОЛЬНОГО/ НО хэшируемого! типа(чаще: Int, String). Все ключи д.б. ОДНОГО типа данных. Равно - все значения.
 ИДЕЯ СЛОВАРЯ: используй уникальные / пользовательские ключи для доступа к значениям. */

dictionaryLetters: [String: String] = ["a": "alfa", "b": "beta", "g": "gamma", "d": "delta"]
print(dictionaryLetters)
