import UIKit

// CLOSURES 'ЗАМЫКАНИЯ': Advanced Level 'продвинутый уровень'.

/*
 1. создай func, которая принимает массив Double. Напиши алгоритм, который находит в массиве min значение. Распечатай рез-т на консоль
 */
/*
 2. в этом же массиве найди max значение. Распечатай рез-т на консоль
 */
/*
 3. создай func, которая принимает массив букв - Characters. Отс ортируйте массив так, чтобы главсные оказались в левой части, а согласные - в правой. Разделите массив на гласные/согласные(2 отдельных массива). Отсортируйте каждый по алфавиту. Распечатай рез-т на консоль
 */
/*
 4. сложите получившиеся массивы в один. Распечатай рез-т на консоль
 */
